//正则验证规则
export default {
    //身份证
    IDCard: /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
    //手机号码
    Phone: /^1[3-9]\d{9}$/,
    //不能为空
    Required: /\S+/,
    //四位数字
    Code: /\d{4}$/,
    //数字
    Number: /^[0-9]*$/,
    //大于零的数字
    Number1: /^[1-9][0-9]*$/,
    //数字，最多保留两位小数
    NF2: /^\d+(?:\.\d{1,2})?$/,
    //大于1小于100的数字，最多保留两位小数
    CarLong: /(^[1-9][0-9]{0,1}$)|(^[1-9][0-9]{0,1}[\.]{1}[0-9]{1,2}$)/,
    // 银行卡账号
    bankCard: /^([1-9]{1})(\d{15}|\d{18})$/,
    // 正数（包括小数）> 0
    Number2: /^([1-9]\d*(\.\d*[1-9])?)|(0\.\d*[1-9])$/,
    //银行卡号长度
    Bankcard: /^[0-9]{15,19}$/,
}
